{
	"data" : [
		{"URL":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/simple-roasted-pork-shoulder-recipe-1923881","imageURL":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/4/10/0/BI0601_simple-roasted-pork-shoulder_s4x3.jpg.rend.hgtvcom.826.620.suffix/1399386709681.jpeg","author":"AARON MCCARGO JR.","recipeName":"Simple Roasted Pork Shoulder","difficulty":"Easy","totalTime":"4 hr 55 min","prepTime":"5 min","inactiveTime":"30 min","activeTime":"","cookTime":"4 hr 20 min","yield":"2 pounds of meat","ingredients":{"main":["3 tablespoons olive oil","3 tablespoons chopped garlic","Salt and freshly ground black pepper","1 (4 pound) pork shoulder"]},"directions":{"main":["Preheat the oven to 425 degrees F.","In a small bowl, mix together the olive oil, garlic, salt and pepper. Using a pastry brush, spread the mixture all over the pork shoulder.","Set the meat on a rack set into a roasting pan. Roast for 20 minutes, and then reduce the heat to 325 degrees F. Continue to cook until an instant-read thermometer inserted into the shoulder reads 185 degrees F, about 4 hours. Remove the pork from the oven and let stand until cool enough to handle, about 30 minutes."]}},
		{"URL":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/spiked-apple-cider-cocktails-recipe-1922650","imageURL":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2010/4/16/1/BI0510_Cinnamon-Apple-Cider-Cocktail_s4x3.jpg.rend.hgtvcom.826.620.suffix/1382539262681.jpeg","author":"AARON MCCARGO JR.","recipeName":"Spiked Apple Cider Cocktails","difficulty":"Easy","totalTime":"10 min","prepTime":"10 min","inactiveTime":"","activeTime":"","cookTime":"","yield":"4 to 6 servings","ingredients":{"main":["1/4 gallon apple cider","1/2 cup dark rum","1/2 cup cinnamon schnapps","1 Granny Smith apple, peeled, cut into large chunks","1/2 lemon, juiced"]},"directions":{"main":["Mix together the cider, rum, and schnapps in a large pitcher. Add the apples to a small bowl and toss them with the lemon juice. Thread the diced apples onto skewers. Pour the spiked cider into glasses filled with ice, then garnish with an apple skewer and serve."]}},
		{"URL":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/oven-roasted-prime-rib-with-horseradish-sauce-recipe-1941158","imageURL":"","author":"AARON MCCARGO JR.","recipeName":"Oven-Roasted Prime Rib with Horseradish Sauce","difficulty":"Easy","totalTime":"2 hr 10 min","prepTime":"10 min","inactiveTime":"10 min","activeTime":"","cookTime":"1 hr 50 min","yield":"4 to 6 servings","ingredients":{"main":["6 pounds Prime Rib with bone, remove excess fat","2 tablespoons fennel seed","2 tablespoons whole coriander seed","2 tablespoons granulated garlic","1 tablespoons caraway seed","1 tablespoon black peppercorns","1/4 cup coarse sea salt","1/4 cup grapeseed oil","Horseradish Sauce, recipe follows"],"Horseradish Sauce:":["2 tablespoons freshly grated horseradish","8 ounces sour cream drained","1/4 cup fresh lemon juice","1 tablespoons Worcestershire sauce","1/2 teaspoon black pepper","Salt","Dash hot sauce"]},"directions":{"main":["Preheat oven to 325 degrees F.","In a coffee grinder, pulse spices until well combined and slightly coarse; add sea salt. Rub prime rib thoroughly with spices, coating entirely.","Pour oil over roast. Gently rub in. Sear prime rib in a heavy saute pan on all three sides; about 2 to 3 minutes each side. Place pan in oven. Cook for 1 1/2 hours until you reach an internal temperature of 135 degrees F.","Remove from oven and place on hot grill for an additional 15 minutes to grab grill flavor and caramelize the surface of the meat. Remove from grill and let rest for 10 minutes before slicing. Serve with the Horseradish Sauce."],"Horseradish Sauce:":["In a medium sized bowl, mix together all ingredients and serve with Prime Rib. Place in refrigerator until ready to serve."]}},
		{"URL":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/chicken-francaise-recipe-1924391","imageURL":"","author":"AARON MCCARGO JR.","recipeName":"Chicken Francaise","difficulty":"Easy","totalTime":"37 min","prepTime":"20 min","inactiveTime":"","activeTime":"","cookTime":"17 min","yield":"4 servings","ingredients":{"main":["2 boneless and skinless chicken breast halves (about 12 ounces)","Flour, for dredging","Salt and freshly ground black pepper","1 teaspoon plus pinch paprika","4 eggs, beaten","2 tablespoons grated Parmesan","1/4 cup chopped fresh parsley, divided","1/4 cup olive oil, divided","4 tablespoons butter, cold, divided","2 tablespoons chopped garlic","1/2 teaspoon crushed red pepper flakes","1/2 cup white wine","2 cups chicken stock","1 teaspoon chicken bouillon powder","1 lemon, zested","2 lemons, juiced","4 cups baby arugula, washed and spun dry, for serving"]},"directions":{"main":["Place the chicken, in batches if necessary, in a large zipped bag (or between 2 sheets of plastic wrap). With a meat mallet, pound the chicken to 1/2-inch thickness. Cut each breast into thirds.","Put the flour in a shallow dish, adding a pinch of salt, pepper and 1 teaspoon paprika. Take a heaping tablespoon and set aside for later use. In a second shallow dish, add the eggs. Mix in the Parmesan, 2 tablespoons parsley and a pinch of salt, pepper and paprika. Dredge each chicken cutlet in the flour and then the egg mixture, making sure to get all sides.","Place a large saute pan over high heat and add 2 tablespoons olive oil and 2 tablespoons butter. Place the breaded chicken into the hot pan, 2 pieces at a time. Cook for 3 minutes, undisturbed. Flip and cook until the chicken has cooked through, reaching a temperature of 160 degrees F, about 3 more minutes. Remove the chicken from the pan and repeat the process with the remaining pieces of chicken.","In the same saute pan over medium heat, add the remaining 2 tablespoons olive oil, garlic, crushed red pepper and reserved seasoned flour. Cook until the garlic becomes aromatic, about 1 minute. Add the white wine and chicken stock and continue to cook for another minute. Add the bouillon powder, lemon zest and lemon juice and sprinkle with salt and pepper. Remove the pan from the heat and stir in the remaining 2 tablespoons butter to thicken the sauce. Taste for seasoning.","Add the arugula to each dish or to 1 large platter. Place the chicken on top and drizzle with the sauce. Serve immediately."]}},
		{"URL":"https://www.foodnetwork.com/recipes/loaded-lobster-roll-recipe-1919906","imageURL":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/6/6/0/BI0410_Loaded-Lobster-Roll_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371597708608.jpeg","author":"AARON MCCARGO JR.","recipeName":"Loaded Lobster Roll","difficulty":"Easy","totalTime":"22 min","prepTime":"10 min","inactiveTime":"","activeTime":"","cookTime":"12 min","yield":"4 servings","ingredients":{"main":["2 (1-pound) lobsters","2 tablespoons mayonnaise","2 tablespoons creme fraiche","3 tablespoons diced shallots","1 lemon, juiced","2 tablespoons chopped chives","2 tablespoons chopped parsley leaves","1 avocado, halved, pitted and flesh diced","8 slices thick cut bacon, cooked crisp and crumbled","Salt and freshly cracked black pepper","4 brioche rolls, split"]},"directions":{"main":["Preheat the oven to 400 degrees F.","Bring a large stock pot with approximately 2 gallons of salted water to a boil over high heat. Add the lobsters and boil for about 8 minutes. Drain from water and shock in an ice bath. Once cooled, remove the knuckles, claws and tail from the body of the lobster by a slight twist and pull. Split the tail with a knife, remove the meat from the shell and set aside. Pull off the claw pincher. Crack the claws with a nutcracker and remove the meat. Set aside. Using kitchen shears cut through the knuckle portion and remove the meat. Give all of the lobster meat a good rinse and roughly dice. Put into a large bowl and set aside.","In the large bowl, add the mayonnaise, creme fraiche, shallots, lemon juice, chives, parsley, avocado, bacon, salt and pepper, to taste, and combine well. Cover and refrigerate before assembling the sandwich.","Toast the brioche rolls in the oven until slightly colored, about 4 minutes. Assemble the sandwich by putting a liberal amount of lobster salad on each roll and serve."]}},
		{"URL":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/joshs-roast-pork-sandwich-recipe0-1957237","imageURL":"","author":"AARON MCCARGO JR.","recipeName":"Josh's Roast Pork Sandwich","difficulty":"Easy","totalTime":"1 hr 30 min","prepTime":"10 min","inactiveTime":"5 min","activeTime":"","cookTime":"1 hr 15 min","yield":"4 to 6 servings","ingredients":{"main":["2 pounds boneless pork loin","1/2 cup plus 2 tablespoons Big Daddy Seasoning, recipe follows","1/4 cup grapeseed oil","Kosher salt","1 1/2 pounds fresh broccoli rabe, cleaned and roughly chopped","2 tablespoons chopped fresh garlic","2 tablespoons red pepper flakes","4 to 6 ciabatta rolls","1 pound provolone, sliced","Cracked black pepper"],"Big Daddy Seasoning:":["1/2 cup smokey paprika","1/4 cup granulated onion powder","1/4 cup granulated garlic powder","3 tablespoons seasoned salt","1/4 cup fresh cracked pepper","1/2 cup kosher salt"]},"directions":{"main":["Preheat oven to 375 degrees F.","Rub pork loin with 1/2 cup Big Daddy Seasoning and allow to sit at room temperature for 15 minutes. In a large cast-iron pan over medium heat, add 2 tablespoons grapeseed oil; Seer pork loin on all sides and both ends.","Add pork to a roasting pan with rack and roast in oven for approximately 1 hour until internal temperature reaches 155 degrees F. Remove from oven and allow to rest for 5 minutes. Slice pork very thin.","In a large pot of boiling salted water, add broccoli rabe and blanch for 3 to 4 minutes. Strain from water and shock in a bowl of ice water to stop cooking. Drain from ice water.","In a large skillet over medium heat, add remaining oil, garlic and red pepper flakes. Cook until fragrant. Add the cooked broccoli rabe. Add 2 tablespoons Big Daddy Seasoning and mix together. Remove from pan.","Assemble ciabatta rolls upside down; add provolone cheese, pork and broccoli rabe. Season with salt and pepper, to taste. Toast sandwiches for 3 to 4 minutes on each side."],"Big Daddy Seasoning:":["In a large bowl, mix ingredients together.;"]}},
		{"URL":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/homemade-lemon-doughnuts-recipe-1949271","imageURL":"","author":"AARON MCCARGO JR.","recipeName":"Homemade Lemon Doughnuts","difficulty":"Easy","totalTime":"40 min","prepTime":"20 min","inactiveTime":"10 min","activeTime":"","cookTime":"10 min","yield":"6 servings","ingredients":{"main":["Canola oil, for frying","2 tablespoons shortening","2 tablespoons Mascarpone cheese","1/2 cup sugar","1/2 cup buttermilk","1 egg","1/2 teaspoon vanilla extract","1 tablespoon lemon juice","1 lemon, zested","2 cups flour, sifted","1/2 teaspoon baking soda","1/2 teaspoon baking powder","Pinch salt","Powdered sugar, to garnish","Fresh berries, to garnish"]},"directions":{"main":["Preheat fryer to 375 degrees F. with canola oil.","In a medium sized bowl, cream together shortening, mascarpone and sugar. In a measuring cup mix together buttermilk, egg, vanilla, lemon juice and zest. Slowly beat in egg mixture. Once well blended slowly add flour, baking soda, baking powder and salt.","Roll dough out on a floured surface until 1/3-inch thick. Punch out doughnuts with a 1 1/2-inch biscuit cutter or donut cutter. Let stand 10 minutes. Fry until golden. Remove from fryer and dust with powdered sugar. Serve with fresh berries."]}},
